ProgessBase/Documents/ПРГ_ФактическиОтработанныеМашиноЧасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_ФактическиОтработанныеМашиноЧасы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Машиночасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПродукции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МашиноЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКилограмм</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛитров</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/Documents/ПРГ_ФактическиОтработанныеМашиноЧасы/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// сделаем проверку на 1 документ
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПРГ_ФактическиОтработанныеМашиноЧасы.Ссылка
	                      |ИЗ
	                      |	Документ.ПРГ_ФактическиОтработанныеМашиноЧасы КАК ПРГ_ФактическиОтработанныеМашиноЧасы
	                      |ГДЕ
	                      |	ПРГ_ФактическиОтработанныеМашиноЧасы.Организация = &Организация
	                      |	И ПРГ_ФактическиОтработанныеМашиноЧасы.Ссылка <> &Ссылка
	                      |	И ПРГ_ФактическиОтработанныеМашиноЧасы.Проведен
	                      |	И ПРГ_ФактическиОтработанныеМашиноЧасы.Дата МЕЖДУ &Дата1 И &Дата2");
						  
	Запрос.УстановитьПараметр("Дата1",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В одном месяце допускается ввод однового документа по воде",Отказ);
	КонеЦесли;	
	
	//проверим потреблено не может меньше всего
	Для Каждого Текстрока Из  МашиноЧасы Цикл
		Если Текстрока.МашиноЧасы = 0  Тогда
			 Сообщить("В строке не заполнена информация по машиночасам !!!");
			 //ОбщегоНазначения.СообщитьОбОшибке("В строке № "+Текстрока.НомерСтроки+" не заполнены машино часы !!!",Отказ);
	    КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры
